class ScooterHomePageFAQ:
    answer1 = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    answer2 = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    answer3 = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    answer4 = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    answer5 = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    answer6 = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    answer7 = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    answer8 = "Да, обязательно. Всем самокатов! И Москве, и Московской области."

class ScooterOrderPageData:
    data_sets = {
        'data_set1': {
            'first_name': 'Лиза',
            'last_name': 'Афанасьева',
            'address': 'Ленинградская улица',
            'subway_name': 'Маяковская',
            'telephone_number': '79876786767',
            'date': '24.09.2024',
            'rental_period': 2,
            'color': [0],
            'comment_for_courier': 'Не звонить',
            'description': 'Корректные данные'
        },
        'data_set2':
            {'first_name': 'Вадим',
             'last_name': 'Бобров',
             'address': 'Кунцевская улица',
             'subway_name': 'Войковская',
             'telephone_number': '79657654534',
             'date': '24.09.2024',
             'rental_period': 1,
             'color': [1, 0],
             'comment_for_courier': 'Не стучать',
             'description': 'Корректные данные'
             },
    }
